# fullmeta  -*- mode: org; fill-column: 90 -*-
#+CATEGORY: fullmeta
#+STARTUP: content
#+seq_todo: TODO STARTED(s/@) BLOCKED(b@/@) | DONE(d@/@) DEFERRED(f@/@) CANCELLED(x@/@) IDEA(i/@)
#+TAGS: { TIL(t) }
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
#+COLUMNS: %30ITEM(Task) %CLOCKSUM %15Effort(Effort){:}

*** DONE Implement cgi/assert
CLOSED: [2020-12-08 Tue 12:10] SCHEDULED: <2020-12-08 Tue>
- State "DONE"       from "STARTED"    [2020-12-08 Tue 12:10]
:LOGBOOK:
CLOCK: [2020-12-08 Tue 08:42]--[2020-12-08 Tue 12:10] =>  3:28
:END:

**** DONE Support :fail fast predicate
CLOSED: [2020-12-08 Tue 15:11] SCHEDULED: <2020-12-08 Tue>
- State "DONE"       from "STARTED"    [2020-12-08 Tue 15:11]
:LOGBOOK:
CLOCK: [2020-12-08 Tue 14:06]--[2020-12-08 Tue 15:11] =>  1:05
:END:

That would quickly delegate requests that :fail the predicate to subsequent cgi-contexts
or handlers. E.g.:

#+begin_src clojure
  (middleware {:root "pledge/www/pling"
               :fail (fn [request]
                       (let [name (-> request :original :server name)]
                         (or (empty? name)
                             (= name "unknown")
                             (= name "www")
                             (= name "id")
                             (-> request proto/store nil?))))})
#+end_src

*** DONE Carefully rething cgi-routes reloading
CLOSED: [2020-12-10 Thu 11:07] SCHEDULED: <2020-12-10 Thu>
- State "DONE"       from "STARTED"    [2020-12-10 Thu 11:07] \\
  We now reload routes only to update middleware context and only
  whenever =cgi/*reload-routes*= is true (default). Going theory is that
  in production we'd set it to nil, whereas routing or handling requests
  manually while developing we'd recompute context every time, that is I
  expect to take care not to bind any request or context to a top level
  var, but rather recompute every time I create a request.
:LOGBOOK:
CLOCK: [2020-12-10 Thu 08:54]--[2020-12-10 Thu 11:07] =>  2:13
:END:

I don't want to recompute cgi routes more than once "per request" but I also want to
somehow guarantee that I don't find myself with stale routes in dev, which can happen if
you e.g. store context or request in a var and then reuse it while routes changed.

Probably most reliable thing is to timestamp (hash) cgi root subtree?

